; domain
(define (domain ferry)
  (:requirements :strips :constraints :negative-preconditions)
   (:predicates (not-eq ?v1 ?v4)
		(pred_4 ?v5)
		(pred_2 ?v3)
		(pred_1 ?v3)
		(pred_5 ?v5 ?v3)
		(pred_6)
		(pred_3 ?v5))

   (:action op_2
       :parameters  (?v2 ?v7)
       :precondition (and (not-eq ?v2 ?v7) 
                          (pred_2 ?v2) (pred_2 ?v7) (pred_1 ?v2))
       :effect (and  (pred_1 ?v7)
		     (not (pred_1 ?v2))))


   (:action op_1
       :parameters (?v8 ?v6)
       :precondition  (and  (pred_4 ?v8) (pred_2 ?v6)
			    (pred_5 ?v8 ?v6) (pred_1 ?v6) (pred_6))
       :effect (and (pred_3 ?v8)
		    (not (pred_5 ?v8 ?v6)) 
		    (not (pred_6))))

   (:action op_3
       :parameters  (?v8  ?v6)
       :precondition  (and  (pred_4 ?v8) (pred_2 ?v6)
			    (pred_3 ?v8) (pred_1 ?v6))
       :effect (and (pred_5 ?v8 ?v6)
		    (pred_6)
		    (not (pred_3 ?v8)))))

; problem
(define (problem ferry-l6-c2)
(:domain ferry)
(:objects obj_06 obj_03 obj_04 obj_05 obj_02 obj_07 
          obj_01 obj_08 
)
(:init
(pred_2 obj_06)
(pred_2 obj_03)
(pred_2 obj_04)
(pred_2 obj_05)
(pred_2 obj_02)
(pred_2 obj_07)
(pred_4 obj_01)
(pred_4 obj_08)
(not-eq obj_06 obj_03)
(not-eq obj_03 obj_06)
(not-eq obj_06 obj_04)
(not-eq obj_04 obj_06)
(not-eq obj_06 obj_05)
(not-eq obj_05 obj_06)
(not-eq obj_06 obj_02)
(not-eq obj_02 obj_06)
(not-eq obj_06 obj_07)
(not-eq obj_07 obj_06)
(not-eq obj_03 obj_04)
(not-eq obj_04 obj_03)
(not-eq obj_03 obj_05)
(not-eq obj_05 obj_03)
(not-eq obj_03 obj_02)
(not-eq obj_02 obj_03)
(not-eq obj_03 obj_07)
(not-eq obj_07 obj_03)
(not-eq obj_04 obj_05)
(not-eq obj_05 obj_04)
(not-eq obj_04 obj_02)
(not-eq obj_02 obj_04)
(not-eq obj_04 obj_07)
(not-eq obj_07 obj_04)
(not-eq obj_05 obj_02)
(not-eq obj_02 obj_05)
(not-eq obj_05 obj_07)
(not-eq obj_07 obj_05)
(not-eq obj_02 obj_07)
(not-eq obj_07 obj_02)
(pred_6)
(pred_5 obj_01 obj_04)
(pred_5 obj_08 obj_07)
(pred_1 obj_06)
)
(:goal
(and
(pred_5 obj_01 obj_06)
(pred_5 obj_08 obj_06)
)
)

(:constraints
  (and
    (sometime-before  (pred_5 obj_01 obj_06) (pred_1 obj_03))
    (sometime-before  (pred_5 obj_08 obj_06) (pred_1 obj_03))
  )
)
)

; plan
1. (op_2 obj_06 obj_04)
   deleted: (pred_1 obj_06)
   added: (pred_1 obj_04)
   goals met: 0 of 2
2. (op_1 obj_01 obj_04)
   deleted: (pred_5 obj_01 obj_04) (pred_6)
   added: (pred_3 obj_01)
   goals met: 0 of 2
3. (op_2 obj_04 obj_03)
   deleted: (pred_1 obj_04)
   added: (pred_1 obj_03)
   goals met: 0 of 2
4. (op_3 obj_01 obj_03)
   deleted: (pred_3 obj_01)
   added: (pred_5 obj_01 obj_03) (pred_6)
   goals met: 0 of 2
5. (op_2 obj_03 obj_07)
   deleted: (pred_1 obj_03)
   added: (pred_1 obj_07)
   goals met: 0 of 2
6. (op_1 obj_08 obj_07)
   deleted: (pred_5 obj_08 obj_07) (pred_6)
   added: (pred_3 obj_08)
   goals met: 0 of 2
7. (op_2 obj_07 obj_06)
   deleted: (pred_1 obj_07)
   added: (pred_1 obj_06)
   goals met: 0 of 2
8. (op_3 obj_08 obj_06)
   deleted: (pred_3 obj_08)
   added: (pred_5 obj_08 obj_06) (pred_6)
   goals met: 1 of 2
9. (op_2 obj_06 obj_03)
   deleted: (pred_1 obj_06)
   added: (pred_1 obj_03)
   goals met: 1 of 2
10. (op_1 obj_01 obj_03)
   deleted: (pred_5 obj_01 obj_03) (pred_6)
   added: (pred_3 obj_01)
   goals met: 1 of 2
11. (op_2 obj_03 obj_06)
   deleted: (pred_1 obj_03)
   added: (pred_1 obj_06)
   goals met: 1 of 2
12. (op_3 obj_01 obj_06)
   deleted: (pred_3 obj_01)
   added: (pred_5 obj_01 obj_06) (pred_6)
   goals met: 2 of 2
